Reports/СправкаРасчетПереоценкиВалютныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>СправкаРасчетПереоценкиВалютныхСредств</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/РасчетыСПоставщикамиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщикамиПоДокументам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КВозврату</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предоплата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗалогЗаТаруРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСПоставщиком</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/АналитикаУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСКлиентамиПоДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентамиПоДокументам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КВозврату</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предоплата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗалогЗаТаруРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВариантыКурсаДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыКурсаДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Переменный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйНаДатуОтгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленныйВДоговоре</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/СправкаРасчетПереоценкиВалютныхСредств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - См. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   ЭтаФорма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Булево -Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Булево - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если ЗакрытиеМесяцаСервер.ЭтаФормаОткрытаИзФормыЗакрытияМесяца(ЭтаФорма) Тогда
		
		ЭтаФорма.КлючНазначенияИспользования = "КонтекстЗакрытиеМесяца";
		Параметры = ЭтаФорма.Параметры;
		ФормаПараметры = ЭтаФорма.ФормаПараметры;
		
		ФормаПараметры.КлючНазначенияИспользования = ЭтаФорма.КлючНазначенияИспользования;
		
		ПериодОтчета = Новый СтандартныйПериод(НачалоМесяца(Параметры.ПериодРегистрации), КонецМесяца(Параметры.ПериодРегистрации));
		ФормаПараметры.Отбор.Очистить();
		ФормаПараметры.Отбор.Вставить("ПериодОтчета", ПериодОтчета);
		Если НЕ Параметры.ВсеОрганизации Тогда
			ФормаПараметры.Отбор.Вставить("Организация", Параметры.МассивОрганизаций);
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользуетсяУправлениеВНА = Ложь;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") 
		И НЕ ИспользуетсяУправлениеВНА Тогда
		
		ПолеРазделПереоценки = СхемаКомпоновкиДанных.НаборыДанных.Движения.Поля.Найти("РазделПереоценки");
		РазделыПереоценки = ПолеРазделПереоценки.ПолучитьДоступныеЗначения();
		ЭлементСписка = РазделыПереоценки.НайтиПоЗначению("РасчетыПоФинансовымИнструментам");
		РазделыПереоценки.Удалить(ЭлементСписка);
		ПолеРазделПереоценки.УстановитьДоступныеЗначения(РазделыПереоценки);
		
		АдресСхемы = ЭтаФорма.НастройкиОтчета.АдресСхемы;
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.НастройкиОтчета.АдресСхемы);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИспользоватьДоговорыКредитовИДепозитов = Константы.ИспользоватьДоговорыКредитовИДепозитов.Получить();
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ИспользоватьДоговорыКредитовИДепозитов", ИспользоватьДоговорыКредитовИДепозитов);
	
	Если НЕ ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		Движения = СхемаКомпоновкиДанных.НаборыДанных.Движения; // НаборДанныхОбъединениеСхемыКомпоновкиДанных - 
		Движения.Элементы.РасчетыСПоставщиками.Запрос = ТекстЗапросаРасчетыСПоставщиками();
		Движения.Элементы.РасчетыСКлиентами.Запрос = ТекстЗапросаРасчетыСКлиентами();
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") ИЛИ НЕ ПолучитьФункциональнуюОпцию("ЛокализацияРФ") Тогда
		Поле = СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ТребуетсяНачислениеНУ");
		Поле.Выражение = "0";
		Поле = СхемаКомпоновкиДанных.ПоляИтога.Найти("ТребуетсяНачислениеНУ");
		Поле.Выражение = "0";
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	УстановитьОтборТребующиеНачисления(НастройкиОтчета);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураДинамическихЗаголовков(), МакетКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОтборТребующиеНачисления(НастройкиОтчета)
	
	Отборы = Новый Структура;
	ПолучитьОтборыТребующиеНачисления(НастройкиОтчета.Структура, Отборы);
	Если Отборы.Свойство("Аналитика") Тогда
		НовоеИспользование = Отборы.Аналитика.Использование;
		Для Каждого Отбор Из Отборы Цикл
			Отбор.Значение.Использование = НовоеИспользование;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьОтборыТребующиеНачисления(СтруктураОтчета, Отборы)
	
	Для Каждого Группировка Из СтруктураОтчета Цикл
		
		Если ТипЗнч(Группировка) = Тип("ГруппировкаКомпоновкиДанных")
			ИЛИ ТипЗнч(Группировка) = Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
			ЭлементОтбора = НайтиОтборПоПредставлению(Группировка.Отбор.Элементы, "ТребующиеНачисления");
			Если ЭлементОтбора <> Неопределено Тогда
				Отборы.Вставить(Группировка.Имя, ЭлементОтбора);
			КонецЕсли;
			ПолучитьОтборыТребующиеНачисления(Группировка.Структура, Отборы);
			
		ИначеЕсли ТипЗнч(Группировка) = Тип("ТаблицаКомпоновкиДанных") Тогда
			ПолучитьОтборыТребующиеНачисления(Группировка.Строки, Отборы);
			ПолучитьОтборыТребующиеНачисления(Группировка.Колонки, Отборы);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиОтборПоПредставлению(Отбор, Представление)
	
	Результат = Неопределено;
	Для Каждого Элемент Из Отбор Цикл
		Если СтрНачинаетсяС(Элемент.Представление, Представление) Тогда
			Результат = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

Функция СтруктураДинамическихЗаголовков()
	
	ДинамическиеЗаголовки = Новый Соответствие;
	
	ДинамическиеЗаголовки.Вставить("1", Константы.ВалютаУправленческогоУчета.Получить());
	
	Возврат ДинамическиеЗаголовки;
	
КонецФункции

Функция ТекстЗапросаРасчетыСПоставщиками()
	
	Возврат
	"ВЫБРАТЬ
	|	&НачалоПериода КАК Период,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) КАК ДатаОстатка,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	Аналитика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Расчеты.ДолгОстаток КАК Сумма,
	|	Расчеты.ДолгУпрОстаток КАК СуммаУпр,
	|	Расчеты.ДолгРеглОстаток КАК СуммаРегл,
	|	0 КАК ДоходУпр,
	|	0 КАК РасходУпр,
	|	0 КАК ДоходРегл,
	|	0 КАК РасходРегл,
	|	Расчеты.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	Расчеты.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	Расчеты.ЗаказПоставщику КАК ОбъектРасчетов,
	|	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент
	|ПОМЕСТИТЬ втОстаткиИОбороты
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(
	|			&Период,
	|			Валюта <> &ВалютаУпр
	|				ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета {(АналитикаУчетаПоПартнерам).*, (ЗаказПоставщику).*, (РасчетныйДокумент).*, (Валюта).*}) КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|{ГДЕ
	|	Аналитика.Организация.*,
	|	Аналитика.Партнер.*,
	|	Аналитика.Контрагент.*,
	|	Аналитика.Договор.*,
	|	Аналитика.НаправлениеДеятельности.*}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расчеты.Период,
	|	НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ),
	|	Расчеты.Регистратор,
	|	Расчеты.Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	Аналитика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Расчеты.Долг
	|		ИНАЧЕ -Расчеты.Долг
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Расчеты.ДолгУпр
	|		ИНАЧЕ -Расчеты.ДолгУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Расчеты.ДолгРегл
	|		ИНАЧЕ -Расчеты.ДолгРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоходУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА -(Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоходРегл,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА -(Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходРегл,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|		ИНАЧЕ Расчеты.ПредоплатаУпр
	|	КОНЕЦ КАК  ПредоплатаУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|		ИНАЧЕ Расчеты.ПредоплатаРегл
	|	КОНЕЦ КАК ПредоплатаРегл,
	|	Расчеты.ЗаказПоставщику,
	|	Расчеты.РасчетныйДокумент
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУпр ИЛИ Расчеты.Валюта <> Аналитика.Организация.ВалютаРегламентированногоУчета)
	|{ГДЕ
	|	Расчеты.Регистратор,
	|	Расчеты.Валюта.*,
	|	Расчеты.Период,
	|	Расчеты.АналитикаУчетаПоПартнерам.*,
	|	Расчеты.ЗаказПоставщику.*,
	|	Расчеты.РасчетныйДокумент.*,
	|	Аналитика.Организация.*,
	|	Аналитика.Партнер.*,
	|	Аналитика.Контрагент.*,
	|	Аналитика.Договор.*,
	|	Аналитика.НаправлениеДеятельности.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОбороты.Период КАК Период,
	|	ОстаткиИОбороты.ДатаОстатка КАК ДатаОстатка,
	|	ОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиИОбороты.Контрагент КАК Аналитика,
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.Организация КАК Организация,
	|	ОстаткиИОбороты.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ОстаткиИОбороты.Партнер КАК Партнер,
	|	ОстаткиИОбороты.Контрагент КАК Контрагент,
	|	ОстаткиИОбороты.Договор КАК Договор,
	|	ОстаткиИОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СУММА(ОстаткиИОбороты.Сумма) КАК Сумма,
	|	СУММА(ОстаткиИОбороты.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ОстаткиИОбороты.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаУпр КОНЕЦ) КАК СуммаУпрДО,
	|	СУММА(ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаРегл КОНЕЦ) КАК СуммаРеглДО,
	|	СУММА(ОстаткиИОбороты.ДоходУпр) КАК ДоходУпр,
	|	-СУММА(ОстаткиИОбороты.РасходУпр) КАК РасходУпр,
	|	СУММА(ОстаткиИОбороты.ДоходРегл) КАК ДоходРегл,
	|	-СУММА(ОстаткиИОбороты.РасходРегл) КАК РасходРегл,
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчета,
	|	ОстаткиИОбороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный) КАК ВариантКурсаДоговора,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорСУстановленнымКурсом,
	|	""РасчетыСПоставщиками"" КАК РазделПереоценки,
	|	200 КАК ПорядокРазделаПереоценки
	|{ВЫБРАТЬ
	|	РазделПереоценки,
	|	Период,
	|	ДатаОстатка,
	|	Регистратор,
	|	Валюта.*,
	|	Аналитика.*,
	|	АналитикаУчетаПоПартнерам.*,
	|	Организация.*,
	|	ВалютаРегламентированногоУчета.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Договор.*,
	|	НаправлениеДеятельности.*,
	|	Сумма,
	|	СуммаУпр,
	|	СуммаРегл,
	|	СуммаУпрДО,
	|	СуммаРеглДО,
	|	ДоходУпр,
	|	РасходУпр,
	|	ДоходРегл,
	|	РасходРегл,
	|	ОбъектРасчета.*,
	|	РасчетныйДокумент.*,
	|	ВариантКурсаДоговора,
	|	ДоговорСУстановленнымКурсом,
	|	ПорядокРазделаПереоценки}
	|ИЗ
	|	втОстаткиИОбороты КАК ОстаткиИОбороты
	|{ГДЕ
	|	""РасчетыСПоставщиками"" КАК РазделПереоценки,
	|	ОстаткиИОбороты.Период,
	|	ОстаткиИОбороты.Контрагент.* КАК Аналитика,
	|	ОстаткиИОбороты.Организация.*,
	|	ОстаткиИОбороты.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ОстаткиИОбороты.Партнер.*,
	|	ОстаткиИОбороты.Контрагент.*,
	|	ОстаткиИОбороты.Договор.*,
	|	ОстаткиИОбороты.НаправлениеДеятельности.*,
	|	ОстаткиИОбороты.Валюта.*,
	|	ОстаткиИОбороты.Сумма,
	|	ОстаткиИОбороты.СуммаУпр,
	|	ОстаткиИОбороты.СуммаРегл,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаУпр КОНЕЦ КАК СуммаУпрДО,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаРегл КОНЕЦ КАК СуммаРеглДО,
	|	ОстаткиИОбороты.ДоходУпр,
	|	ОстаткиИОбороты.РасходУпр,
	|	ОстаткиИОбороты.ДоходРегл,
	|	ОстаткиИОбороты.РасходРегл,
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчета,
	|	ОстаткиИОбороты.РасчетныйДокумент}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.Период,
	|	ОстаткиИОбороты.ДатаОстатка,
	|	ОстаткиИОбороты.Регистратор,
	|	ОстаткиИОбороты.Валюта,
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.Организация,
	|	ОстаткиИОбороты.Партнер,
	|	ОстаткиИОбороты.Контрагент,
	|	ОстаткиИОбороты.Договор,
	|	ОстаткиИОбороты.НаправлениеДеятельности,
	|	ОстаткиИОбороты.ОбъектРасчетов,
	|	ОстаткиИОбороты.РасчетныйДокумент
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
КонецФункции

Функция ТекстЗапросаРасчетыСКлиентами()
	
	Возврат
	"ВЫБРАТЬ
	|	&НачалоПериода КАК Период,
	|	НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) КАК ДатаОстатка,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	Расчеты.Валюта КАК Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ЗаказКлиента.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	Аналитика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Расчеты.ДолгОстаток КАК Сумма,
	|	Расчеты.ДолгУпрОстаток КАК СуммаУпр,
	|	Расчеты.ДолгРеглОстаток КАК СуммаРегл,
	|	0 КАК ДоходУпр,
	|	0 КАК РасходУпр,
	|	0 КАК ДоходРегл,
	|	0 КАК РасходРегл,
	|	Расчеты.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
	|	Расчеты.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
	|	Расчеты.ЗаказКлиента КАК ОбъектРасчетов,
	|	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент
	|ПОМЕСТИТЬ втОстаткиИОбороты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(
	|			&Период,
	|			Валюта <> &ВалютаУпр
	|				ИЛИ Валюта <> АналитикаУчетаПоПартнерам.Организация.ВалютаРегламентированногоУчета {(АналитикаУчетаПоПартнерам).*, (ЗаказКлиента).*, (РасчетныйДокумент).*, (Валюта).*}) КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|{ГДЕ
	|	Аналитика.Организация.*,
	|	Аналитика.Партнер.*,
	|	Аналитика.Контрагент.*,
	|	Аналитика.Договор.*,
	|	Аналитика.НаправлениеДеятельности.*}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Расчеты.Период,
	|	НАЧАЛОПЕРИОДА(Расчеты.Период, ДЕНЬ),
	|	Расчеты.Регистратор,
	|	Расчеты.Валюта,
	|	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ЗаказКлиента.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	Аналитика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Расчеты.Долг
	|		ИНАЧЕ -Расчеты.Долг
	|	КОНЕЦ КАК Долг,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Расчеты.ДолгУпр
	|		ИНАЧЕ -Расчеты.ДолгУпр
	|	КОНЕЦ КАК ДолгУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Расчеты.ДолгРегл
	|		ИНАЧЕ -Расчеты.ДолгРегл
	|	КОНЕЦ КАК ДолгРегл,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоходУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА -(Расчеты.ДолгУпр + Расчеты.ПредоплатаУпр)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДоходРегл,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) = ТИП(Документ.РасчетКУрсовыхРазниц)
	|			ТОГДА -(Расчеты.ДолгРегл + Расчеты.ПредоплатаРегл)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходРегл,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|		ИНАЧЕ Расчеты.ПредоплатаУпр
	|	КОНЕЦ КАК  ПредоплатаУпр,
	|	ВЫБОР
	|		КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|		ИНАЧЕ Расчеты.ПредоплатаРегл
	|	КОНЕЦ КАК ПредоплатаРегл,
	|	Расчеты.ЗаказКлиента,
	|	Расчеты.РасчетныйДокумент
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|	ПО Расчеты.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|ГДЕ
	|	Расчеты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Расчеты.Валюта <> &ВалютаУпр ИЛИ Расчеты.Валюта <> Аналитика.Организация.ВалютаРегламентированногоУчета)
	|{ГДЕ
	|	Расчеты.Регистратор,
	|	Расчеты.Валюта.*,
	|	Расчеты.Период,
	|	Расчеты.АналитикаУчетаПоПартнерам.*,
	|	Расчеты.ЗаказКлиента.*,
	|	Расчеты.РасчетныйДокумент.*,
	|	Аналитика.Организация.*,
	|	Аналитика.Партнер.*,
	|	Аналитика.Контрагент.*,
	|	Аналитика.Договор.*,
	|	Аналитика.НаправлениеДеятельности.*}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиИОбороты.Период КАК Период,
	|	ОстаткиИОбороты.ДатаОстатка КАК ДатаОстатка,
	|	ОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиИОбороты.Контрагент КАК Аналитика,
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.Организация КАК Организация,
	|	ОстаткиИОбороты.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ОстаткиИОбороты.Партнер КАК Партнер,
	|	ОстаткиИОбороты.Контрагент КАК Контрагент,
	|	ОстаткиИОбороты.Договор КАК Договор,
	|	ОстаткиИОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СУММА(ОстаткиИОбороты.Сумма) КАК Сумма,
	|	СУММА(ОстаткиИОбороты.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ОстаткиИОбороты.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаУпр КОНЕЦ) КАК СуммаУпрДО,
	|	СУММА(ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаРегл КОНЕЦ) КАК СуммаРеглДО,
	|	СУММА(ОстаткиИОбороты.ДоходУпр) КАК ДоходУпр,
	|	-СУММА(ОстаткиИОбороты.РасходУпр) КАК РасходУпр,
	|	СУММА(ОстаткиИОбороты.ДоходРегл) КАК ДоходРегл,
	|	-СУММА(ОстаткиИОбороты.РасходРегл) КАК РасходРегл,
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчета,
	|	ОстаткиИОбороты.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный) КАК ВариантКурсаДоговора,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорСУстановленнымКурсом,
	|	""РасчетыСКлиентами"" КАК РазделПереоценки,
	|	100 КАК ПорядокРазделаПереоценки
	|{ВЫБРАТЬ
	|	РазделПереоценки,
	|	Период,
	|	ДатаОстатка,
	|	Регистратор,
	|	Валюта.*,
	|	Аналитика.*,
	|	АналитикаУчетаПоПартнерам.*,
	|	Организация.*,
	|	ВалютаРегламентированногоУчета.*,
	|	Партнер.*,
	|	Контрагент.*,
	|	Договор.*,
	|	НаправлениеДеятельности.*,
	|	Сумма,
	|	СуммаУпр,
	|	СуммаРегл,
	|	СуммаУпрДО,
	|	СуммаРеглДО,
	|	РасходУпр,
	|	ДоходРегл,
	|	РасходРегл,
	|	ОбъектРасчета.*,
	|	РасчетныйДокумент.*,
	|	ВариантКурсаДоговора,
	|	ДоговорСУстановленнымКурсом,
	|	ПорядокРазделаПереоценки}
	|ИЗ
	|	втОстаткиИОбороты КАК ОстаткиИОбороты
	|{ГДЕ
	|	""РасчетыСКлиентами"" КАК РазделПереоценки,
	|	ОстаткиИОбороты.Период,
	|	ОстаткиИОбороты.Контрагент.* КАК Аналитика,
	|	ОстаткиИОбороты.Организация.*,
	|	ОстаткиИОбороты.Организация.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета,
	|	ОстаткиИОбороты.Партнер.*,
	|	ОстаткиИОбороты.Контрагент.*,
	|	ОстаткиИОбороты.Договор.*,
	|	ОстаткиИОбороты.НаправлениеДеятельности.*,
	|	ОстаткиИОбороты.Валюта.*,
	|	ОстаткиИОбороты.Сумма,
	|	ОстаткиИОбороты.СуммаУпр,
	|	ОстаткиИОбороты.СуммаРегл,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаУпр КОНЕЦ КАК СуммаУпрДО,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ОстаткиИОбороты.Регистратор) = ТИП(Документ.РасчетКурсовыхРазниц) ТОГДА 0 ИНАЧЕ ОстаткиИОбороты.СуммаРегл КОНЕЦ КАК СуммаРеглДО,
	|	ОстаткиИОбороты.ДоходУпр,
	|	ОстаткиИОбороты.РасходУпр,
	|	ОстаткиИОбороты.ДоходРегл,
	|	ОстаткиИОбороты.РасходРегл,
	|	ОстаткиИОбороты.ОбъектРасчетов КАК ОбъектРасчета,
	|	ОстаткиИОбороты.РасчетныйДокумент}
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиИОбороты.Период,
	|	ОстаткиИОбороты.ДатаОстатка,
	|	ОстаткиИОбороты.Регистратор,
	|	ОстаткиИОбороты.Валюта,
	|	ОстаткиИОбороты.АналитикаУчетаПоПартнерам,
	|	ОстаткиИОбороты.Организация,
	|	ОстаткиИОбороты.Партнер,
	|	ОстаткиИОбороты.Контрагент,
	|	ОстаткиИОбороты.Договор,
	|	ОстаткиИОбороты.НаправлениеДеятельности,
	|	ОстаткиИОбороты.ОбъектРасчетов,
	|	ОстаткиИОбороты.РасчетныйДокумент
	|	
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
КонецФункции

#КонецОбласти

#КонецЕсли
